validation_cases/lidDrivenCavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          30;
        startFace       1740;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       1770;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1800;
        startFace       1860;
    }
)

// ************************************************************************* //
